# Keyword Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaCommon..::..Keyword Property
SchemaCommon Class See Also
---
The property labeled "Keyword" common to all visual Asset types.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string Keyword { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Keyword As String
	Get
```

Visual C++
---
```text
public:
static property String^ Keyword {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyString". Use ":" to add several keywords.
# See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace